src/cf/Catalogs/уатПравилаФормированияУведомлений_уэ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>уатПравилаФормированияУведомлений_уэ</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АвторУведомления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидУведомления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатСпособыВзаимодействий_уэ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНапоминания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаданиеВажность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыВажностиЗадачи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаданиеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаданиеПроверяющий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РолиИсполнителей</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйУведомления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПравилоИспользуется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокМинут</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОбъекта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатТипыОбъектовДляУведомлений_уэ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСобытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатТипыСобытийДляУведомления_уэ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетнаяЗаписьЭлектроннойПочты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонСообщения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныСообщений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаКомплектовДокументов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатНастройкиКомплектовДокументов_уэ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОбластиПрименения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидОбластиПрименения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.уатВидыОбластейПримененияПравил_уэ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеОбластиПрименения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатПунктыНазначения</v8:Type>
								<v8:Type>cfg:CatalogRef.уатСтатусы_уэ</v8:Type>
								<v8:Type>cfg:CatalogRef.уатМаршруты</v8:Type>
								<v8:Type>cfg:CatalogRef.уатОбъектыСтроительства</v8:Type>
								<v8:Type>cfg:EnumRef.уатТипыТочекМаршрута</v8:Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
								<v8:Type>cfg:CatalogRef.уатТипыПунктов</v8:Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
								<v8:Type>cfg:CatalogRef.уатНаправленияПеревозок</v8:Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>cfg:EnumRef.уатВидыДоставки_уэ</v8:Type>
								<v8:Type>cfg:CatalogRef.уатТипыСобытий_уэ</v8:Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
								<v8:Type>cfg:CatalogRef.уатВидыПеревозок</v8:Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПолучателиУведомлений</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
								<v8:Type>cfg:CatalogRef.РолиИсполнителей</v8:Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипПолучателя</Name>
							<Type>
								<v8:Type>cfg:EnumRef.уатТипыПолучателейУведомлений_уэ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/уатПравилаФормированияУведомлений_уэ/Ext/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	Если ВидУведомления <> Справочники.уатСпособыВзаимодействий_уэ.ЗаданиеПользователю Тогда
		ИндексУдаляемого = ПроверяемыеРеквизиты.Найти("ЗаданиеВажность");
		Если Не ИндексУдаляемого = Неопределено Тогда 
			ПроверяемыеРеквизиты.Удалить(ИндексУдаляемого);
		КонецЕсли;
		
		ИндексУдаляемого = ПроверяемыеРеквизиты.Найти("ЗаданиеНаименование");
		Если Не ИндексУдаляемого = Неопределено Тогда 
			ПроверяемыеРеквизиты.Удалить(ИндексУдаляемого);
		КонецЕсли;
	КонецЕсли;
	
	Если ВидУведомления <> Справочники.уатСпособыВзаимодействий_уэ.ЭлектронноеПисьмо
		И ВидУведомления <> Справочники.уатСпособыВзаимодействий_уэ.SMSСообщение Тогда
		ИндексУдаляемого = ПроверяемыеРеквизиты.Найти("ОтветственныйУведомления");
		Если Не ИндексУдаляемого = Неопределено Тогда 
			ПроверяемыеРеквизиты.Удалить(ИндексУдаляемого);
		КонецЕсли;
	КонецЕсли;
	
	Если ВидУведомления <> Справочники.уатСпособыВзаимодействий_уэ.ЭлектронноеПисьмо Тогда
		ИндексУдаляемого = ПроверяемыеРеквизиты.Найти("УчетнаяЗаписьЭлектроннойПочты");
		Если Не ИндексУдаляемого = Неопределено Тогда 
			ПроверяемыеРеквизиты.Удалить(ИндексУдаляемого);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
